#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/workload-dev-ecs-cluster-fargate"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
    }

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "workload-dev-ecs-cluster-fargate"
      + tags               = {
          + "Name" = "workload-dev-ecs-cluster-fargate"
        }
      + tags_all           = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-cluster-fargate"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "/aws/ecs/workload-dev-ecs-cluster-fargate"
                }
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "workload-dev-ecs-cluster-fargate"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn                = (known after apply)
  + cluster_capacity_providers = (known after apply)
  + cluster_id                 = (known after apply)
  + cluster_name               = "workload-dev-ecs-cluster-fargate"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
aws_vpc.this[0]: Refreshing state... [id=vpc-0d94ad3dc3cf9d85c]
aws_route53_zone.this["thesamcro.com"]: Refreshing state... [id=Z0435032UBOTXJWG12IM]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
aws_internet_gateway.this[0]: Refreshing state... [id=igw-014282ca4ee0f3cc9]
aws_default_security_group.this[0]: Refreshing state... [id=sg-07db7ad127aca9b9c]
aws_subnet.public[0]: Refreshing state... [id=subnet-07cc71c8ccae57316]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-036440546d8eb0c76]
aws_subnet.public[1]: Refreshing state... [id=subnet-06bd693a610ba1902]
aws_subnet.private[0]: Refreshing state... [id=subnet-0968647d51820050b]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c922c6a98dcf1e3b]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-09f7900d0480aed0a]
aws_subnet.public[2]: Refreshing state... [id=subnet-0818b77399efcd5c4]
aws_subnet.private[2]: Refreshing state... [id=subnet-08c7c8dc742580a6e]
aws_route_table.private[0]: Refreshing state... [id=rtb-0073747fb42ccdab4]
aws_route_table.public[0]: Refreshing state... [id=rtb-005957174f54f5c6d]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0790709fe9bd34646]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0787749d2487d9d0a]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4adf4b730a8d5ea]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b588fcc72e3cd5f3]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064aae29ec5049a56]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01739f9831d365050]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-005957174f54f5c6d1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.wrapper["thesamcro.com"].aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:147194901644:certificate/ec2e56c8-2a4a-45bd-baad-c5b494916641]
module.wrapper["thesamcro.com"].aws_route53_record.validation[0]: Refreshing state... [id=Z0435032UBOTXJWG12IM__f969685d8ee6d9edd3fbc1913b71a280.thesamcro.com._CNAME]
module.wrapper["thesamcro.com"].aws_acm_certificate_validation.this[0]: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*